---
kind: property
id: P:Autodesk.Revit.DB.Visual.Wave.WaveNumWaveSets
source: html/2f20cba2-c6d4-6116-73dc-e607cfc49ff3.htm
---
# Autodesk.Revit.DB.Visual.Wave.WaveNumWaveSets Property

The property labeled "Number" from the "Wave" schema.

## Syntax (C#)
```csharp
public static string WaveNumWaveSets { get; }
```

## Remarks
This property is of type "AssetPropertyInteger" within the range of "1, 50".